#include "pstring.h"

PString::PString() : String() {}

PString::PString(const String& str) : String(str) {}

PString::~PString() {}

void PString::write(std::ostream& ostr) const {
    ostr << size() << c_str();
}

void PString::read(std::istream& istr) {
    size_t sizebuf = 0;
    istr >> sizebuf >> std::noskipws; // ÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁÁ
    char* charbuf = new char[sizebuf+1];
    for (size_t i = 0; i < sizebuf; i++)
    {
        istr  >> charbuf[i];
    }
    istr >> std::skipws; // ÁÁÁÁ̵͚̾Ḁ̶́͗Á̸͔͗Á̵̧̗̜̪̦̏̽͑͑́Ą̸̦͚͍̝́͌̈́͑̔Ạ̷̢͓̫̼́̉̍̀̂̇Á̷̖̤̱͚̗̭̪̰͐͑̌̓̏̾̕͘͝ͅĄ̵̢̡̛̮̰̬̼̳́̈́̓̒́̔̔̋͘ͅÁ̷͎͚̣̣̗̺͈̰̲͌̏̀͐̒̓̿̐͠Á̷̖̤̱͚̗̭̪̰͐͑̌̓̏̾̕͘͝ͅĄ̵̢̡̛̮̰̬̼̳́̈́̓̒́̔̔̋͘ͅÁ̷͎͚̣̣̗̺͈̰̲͌̏̀͐̒̓̿̐͠Á̶̢̧͔̰̳̞̩̳̟͉̺̟̟̘͔̾̊̌͐͐̑̀̓͒̀͌́̚̕͘̚̚͜͝Á̶̛͖̭̤̻̥̻̜͔̜̪̥̝̣͔͊̄̉̽͆͗̐͆̽̈̓̓̎͗̊̔͆̚ͅͅĄ̷̡̧̧̛̛͈̭̲̻̫̰̰̣̫̫͎̭̜́̉̒͌͐̏̍̾̊̀̓́͛͑̈́̓̎̃Á̵̡̹̠̫͔̭̦̩̮̰̫̪̩̤͇̮͓͇͖̝̺̩̱̎́̌̅̐̓̊͐̈́̌͛͊̂̃̏̍̀̇̅̔̕͝ͅͅÁ̸̢̝͇̘͙̜̘͕͓̗͇͕̮̩̼̩̘̩͈̖̫̦̣̻͓̩̣̻̑̑̈́̾̑̀̊̏̔͛͐̌͑̽̃̽̉̐̽̓̏̓̂̑̀̄͘̕͝Á̶̛͈̯͖̖̦̻̙̘͕̦͎̟͓͉͈̞͔̬̘̰̃̈̒͗̾̔̔̄̅̋̄̉̔̋̔̉̊̕͜͝͠͝ͅͅͅĄ̶̨̧̡̧̛͍̝̖̞̬̣͍̦͈̣̯̟̩̟̣̗̻̬̱̻̭̟̫̝͍̜̰͎͖̻͖́̋̉̈̓̉͌̔̐̀̒̾̍̿͆́͋́͗́̔̀̓̑̈́͒͛̑̍̕̕͜͜͠ͅÁ̴̧̡̨̧̡̞̥̰̖̭̺̘̮̱̼̦̬̻̥͙̼͕͓͎̟̠͎͎̠̰̘͓̟̗̟̯̫͖̹̭̄̽͌́͆͊̇̔͗̏̃̏͆̐͆͋̈́͊͌̔̔͌̒̍̿͌̅̓͌̑͑̀͘͝͝͝͠͠͝Á̸̧̡̢̨̛̛̻͕̟͚̠̤̟͍̖̘̻͙̬̼̻̼̠̲̬̩̦̳̦̪̙̅̋̒́͐́̍̇̏̉̀̀͂͛͑̽̈́͛̊͌̓̀̎̿̈͊̓̃̃̂͗͘͝Á̶̧̢̧̢̨̧̡̢̛͖͙̖̯̝̣̠̦̲̗̥̫̙̲͇̳̠͙͙̣̯͔̺̰̱̟̯͑̒̆͌̎̎̀̓͒̑́̓̃͛͂̇̀͊̋͌͌͐̈́̄̈́̀͒̈́̕͜͜͝͠͠ͅͅÁ̷̡̨̢̨̢̰̠͎͉͇̠͓̜̥͔̞͔̤̣̟̪̯͚̦̠̗̭̜̱̠͇̻̦̫̟̼͍̫̫͙̘̩̠͍̘̳͈͚̖̓̀̉͗̊͑̃̑́̎͑͋̅͋͐̈́̈̍̎̍͛̎͑̏̔̇̈́̐̒̽́̑͘̕͜͠͠͝͠Á̷̢̧̢̢̢͙̪͕͓͖͍͈̜͕̤͔̣̞͔̘̮̲̙͙͚͇̯̻̖̞̯̭͍͔̞͌͑͋̾̈́̄́̄̐̒͊͒̓̓̈́͑̒͗̀́̊̉̎̍͒́̓̍͌͒̌͐̄̽̿̃͘̚͘Ą̵̧̠͈̣̩͖̭̻̗͈̯͚̬̩̤̗̳̹̘̪̯̘̻̬͚̩̰̠͈̯͎̟̻͎̥̪̳̘̜̳̬͙̬̗͉͙̮̥͓̥̟̼͉̬̫̘̞͓͖̥͓̞̠̻͙́̓̒̽͂͐͊͒̉̑̿̈̈́̌͊̔̈́̅̔̄͜͜͜͜͜ͅÁ̴̢̛̞̻̪̝̙̪̠̻̙̟̱͕̮̬͙̣͈̗̩̣̥͔̙̘̫̝͔͇͙̰͔̪̦̪͈̖̹̥̥͚̘̹̬̦̻͈̯̺͚̹̖̄͋̂̄́̿͑̉͂̍̿̓͋͗̈͛̍̓̿́̎̒̿̔͛̅͐͗̆͜͝͠Á̸̡̨̧̡̧̢̧̡̛̛̯̮̖̝͍̞̮̳͈̦̭̮̺̥̙̩̭͕͍̫̞̬̠̯͓̜̥̞̯̰̠͔̣̱̝̣̪̜̭̟̝͎͔̫̬̤̬̖͖̮̹͎̖̣̦͍͎̜̯͍̐͒́͑̾̊͋̌̑̾́̆̓͂̃͊̓̏͋̆́̿͒̇̆̋͛̐̋̽̅̀̈́̔͘͘͜͜͠͠͝͠͝͝͠ͅͅͅÁ̶̢̢̡̡͚͎̦̖̤͕̫̯͙̥͇̖̗͇͓͓̯̯͔̱͎͔̳̜̩̱͕̫̪̱͍̟̞̺̮̳͖̫̺͎͕̱͈̞̖̜̫̖̞̬̱̻̝͙̱̣̩͔͔̭̦͕̹̘̅̿̉̃̍̽͌͋͒̔͊̊͒̉̉͐͛͒͒͋̊̾̀̒̾̉̽̒̏̓̒̅̿͗͆̓̏͗̈́̚̚̕̚͝͠͠͝͝͝͝ͅͅÁ̷̛̛̛̩̙͎͚̥̞͔̲̙̞̥͎̮̟̤͉̭͇̼̭̝͕̒͑͌̈́͆̒͂̃̑͑̈́̄͗͛̉̈̐̓͋̑̔̑̈́͊͛́̌̀̏̏̎͗͑͜͠͝͝Ą̷̢̨̨̢̧̨̛̬̯͍̲̜͉̖̠̲̻̪̯͍͎̣̪͚̠̦̮͔͙̫̳̦̣̬̯͔͔̜̣̬̞̺̭̝̭̝̜͇̘̤͓͈͇̙̝̼̼͎̦͍̺͇̳̤̱̩͕̝͙̪́̇̈̂́̈̔͂̍̌̈́̾͌̾̐̏͆̍̑͗̀́̎̈́͒́͂́́̃̄̀͑̑̂́͆̀̓̆͒̚̕͜͜͜͜͜͠͝͠͝͠͠͝͝͠͝Á̶̰̙̳̄̊̿̒̄͐͐͛́̇̒̓̾̋̿̇̃̍̽̽̆̆̇̓̓̓͊́̃́͌͌̂̾̇̕͝͝͝͝͝͝Á̷̢̧̢̡̛̫̱͓̦̜͙̫̲̬̠͍̖̰̰̲̗͍͎͎͇͉͓͉̹̮̦̮̯͖̱̝̮̭̮̲̔̈́͆̅͛̌͐̉̾̐̃̀̃́͆̊̄̀͐̇̿͗̎͛͌̆̀̉̃̋̿̒̓͑̓͛̑̀̍͗̅̈̌̑͂͌̈́̆̊́͑̈́̀̚̚̕̚͜͜͠͠͝͝͠Á̶̙̖̤͕͔̣̻̘̳̆͛̾̋̆̈́̋͐̀̈̕͝
    charbuf[sizebuf] = 0;

    *this = String(charbuf);

    delete[] charbuf;
}
